In [2]:
import pandas as pd
import numpy as np

In [40]:
import re

In [3]:
df = pd.read_csv("allocations.csv")
df.head()

,Slot,Roll,Student Name,Department,Program,Company,Job code
0,10.1,183059003,ATHUL S NAMBIAR,Computer Science & Engineering,M.Tech.,Colortokens,1
1,10.1,193100039,Akash Nandalal Gajbhiye,Mechanical Engineering,M.Tech.,Impact Guru Technology Ventures Pvt. Ltd.,1
2,10.1,195280009,Akshi Bansal,Applied Statistics and Informatics,M.Sc.,NeuralTechSoft,1
3,10.1,193070021,Aman Kumar,Electrical Engineering,M.Tech.,Ignitarium Technology Solutions Pvt Ltd,1
4,10.1,193060032,Anmol Mishra,Earth Sciences,M.Tech.,Impact Guru Technology Ventures Pvt. Ltd.,1

In [4]:
df.shape

(1139, 7)

In [5]:
df["Slot"].describe()

count     1139
unique      23
top          .
freq       314
Name: Slot, dtype: object

In [6]:
df["Slot"].value_counts()

.            314
3.1          100
1.1          100
2.2           94
2.1           92
5.1           68
1.2           59
10.1          45
3.2           33
4.2           30
7.1           27
6.1           25
4.1           24
8.1           23
14.1          19
9.1           19
3 (IDC).1     18
1 (IDC).1     12
2 (IDC).1     11
4 (IDC).1      7
11.1           7
12.1           7
15.1           5
Name: Slot, dtype: int64

In [7]:
df["Slot"].dtypes

dtype('O')

In [8]:
def convert(x):
    x = x.replace(" (IDC)","00")
    if x == ".":
        x = "16.3"
    return x

In [9]:
convert("3 (IDC).1")

'300.1'

In [10]:
df["Slot"] = df["Slot"].apply(convert)

In [11]:
df[["Day","Slot No."]] = df["Slot"].str.split(".",expand = True)
df.head(10)

,Slot,Roll,Student Name,Department,Program,Company,Job code,Day,Slot No.
0,10.1,183059003,ATHUL S NAMBIAR,Computer Science & Engineering,M.Tech.,Colortokens,1,10,1
1,10.1,193100039,Akash Nandalal Gajbhiye,Mechanical Engineering,M.Tech.,Impact Guru Technology Ventures Pvt. Ltd.,1,10,1
2,10.1,195280009,Akshi Bansal,Applied Statistics and Informatics,M.Sc.,NeuralTechSoft,1,10,1
3,10.1,193070021,Aman Kumar,Electrical Engineering,M.Tech.,Ignitarium Technology Solutions Pvt Ltd,1,10,1
4,10.1,193060032,Anmol Mishra,Earth Sciences,M.Tech.,Impact Guru Technology Ventures Pvt. Ltd.,1,10,1
5,10.1,183310001,Anshul Shrivastava,Geoinformatics and Natural Resources Engineering,M.Tech.,Regent Climate Connect Knowledge Solutions Pri...,1,10,1
6,10.1,193050057,Ashwani Yadav,Computer Science & Engineering,M.Tech.,Colortokens,1,10,1
7,10.1,170070003,Atharv Amar Pawar,Electrical Engineering,B.Tech.,BeeHyv,1,10,1
8,10.1,193170012,BHAVIK DURUGKAR,Energy Science and Engineering,M.Tech.,Impact Guru Technology Ventures Pvt. Ltd.,1,10,1
9,10.1,183109005,Birla Sandesh Sandeep,Mechanical Engineering,M.Tech.,Applied Materials,2,10,1

In [12]:
df.tail()

,Slot,Roll,Student Name,Department,Program,Company,Job code,Day,Slot No.
1134,16.3,170050005,Yateesh Agrawal,Computer Science & Engineering,B.Tech.,Placement Office,4,16,3
1135,16.3,170100028,Yogender Singh,Mechanical Engineering,B.Tech.,Placement Office,4,16,3
1136,16.3,193100059,Yogesh Supe,Mechanical Engineering,M.Tech.,BYJU'S - The Learning App,1,16,3
1137,16.3,193100075,Zeba Malik,Mechanical Engineering,M.Tech.,Solar Energy Corporation Of India Limited,2,16,3
1138,16.3,16D070061,chandan kumar,Electrical Engineering,Dual Degree (B.Tech. + M.Tech.),Accenture,1,16,3

In [13]:
df.drop(columns = "Slot", inplace=True)

In [14]:
df["Day"] = pd.to_numeric(df["Day"])

In [15]:
df["Slot No."] = pd.to_numeric(df["Slot No."])

In [16]:
df.head()

,Roll,Student Name,Department,Program,Company,Job code,Day,Slot No.
0,183059003,ATHUL S NAMBIAR,Computer Science & Engineering,M.Tech.,Colortokens,1,10,1
1,193100039,Akash Nandalal Gajbhiye,Mechanical Engineering,M.Tech.,Impact Guru Technology Ventures Pvt. Ltd.,1,10,1
2,195280009,Akshi Bansal,Applied Statistics and Informatics,M.Sc.,NeuralTechSoft,1,10,1
3,193070021,Aman Kumar,Electrical Engineering,M.Tech.,Ignitarium Technology Solutions Pvt Ltd,1,10,1
4,193060032,Anmol Mishra,Earth Sciences,M.Tech.,Impact Guru Technology Ventures Pvt. Ltd.,1,10,1

In [17]:
df.drop(columns = "Job code", inplace=True)

In [18]:
df.head()

,Roll,Student Name,Department,Program,Company,Day,Slot No.
0,183059003,ATHUL S NAMBIAR,Computer Science & Engineering,M.Tech.,Colortokens,10,1
1,193100039,Akash Nandalal Gajbhiye,Mechanical Engineering,M.Tech.,Impact Guru Technology Ventures Pvt. Ltd.,10,1
2,195280009,Akshi Bansal,Applied Statistics and Informatics,M.Sc.,NeuralTechSoft,10,1
3,193070021,Aman Kumar,Electrical Engineering,M.Tech.,Ignitarium Technology Solutions Pvt Ltd,10,1
4,193060032,Anmol Mishra,Earth Sciences,M.Tech.,Impact Guru Technology Ventures Pvt. Ltd.,10,1

In [19]:
df_BTech = df[df.Program == "B.Tech."]
df_BTech.head()

,Roll,Student Name,Department,Program,Company,Day,Slot No.
7,170070003,Atharv Amar Pawar,Electrical Engineering,B.Tech.,BeeHyv,10,1
16,160110047,Lokendra Kumar Pushpaj,Metallurgical Engineering and Materials Science,B.Tech.,Agrifi,10,1
17,170050085,Lukka Govinda Siva Nagadev,Computer Science & Engineering,B.Tech.,Agrifi,10,1
19,170020120,Manish Saich,Chemical Engineering,B.Tech.,BeeHyv,10,1
23,170100087,Pavankumar Kotnana,Mechanical Engineering,B.Tech.,BeeHyv,10,1

In [20]:
df_MTech = df[df.Program == "M.Tech."]
df_MTech.head()

,Roll,Student Name,Department,Program,Company,Day,Slot No.
0,183059003,ATHUL S NAMBIAR,Computer Science & Engineering,M.Tech.,Colortokens,10,1
1,193100039,Akash Nandalal Gajbhiye,Mechanical Engineering,M.Tech.,Impact Guru Technology Ventures Pvt. Ltd.,10,1
3,193070021,Aman Kumar,Electrical Engineering,M.Tech.,Ignitarium Technology Solutions Pvt Ltd,10,1
4,193060032,Anmol Mishra,Earth Sciences,M.Tech.,Impact Guru Technology Ventures Pvt. Ltd.,10,1
5,183310001,Anshul Shrivastava,Geoinformatics and Natural Resources Engineering,M.Tech.,Regent Climate Connect Knowledge Solutions Pri...,10,1

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1139 entries, 0 to 1138
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Roll          1139 non-null   object
 1   Student Name  1139 non-null   object
 2   Department    1139 non-null   object
 3   Program       1139 non-null   object
 4   Company       1139 non-null   object
 5   Day           1139 non-null   int64
 6   Slot No.      1139 non-null   int64
dtypes: int64(2), object(5)
memory usage: 62.4+ KB

In [22]:
df.groupby("Slot No.")["Roll"].count()

Slot No.
1    609
2    216
3    314
Name: Roll, dtype: int64

In [23]:
Department_Stats_Breakdown = df.groupby(["Department","Program"], as_index = False)["Roll"].count().sort_values(["Roll","Program","Department"], ascending = [False,True,True])
Department_Stats_Breakdown.reset_index(drop = 1)

,Department,Program,Roll
0,Computer Science & Engineering,B.Tech.,108
1,Electrical Engineering,M.Tech.,101
2,Computer Science & Engineering,M.Tech.,88
3,Mechanical Engineering,B.Tech.,78
4,Chemical Engineering,B.Tech.,73
5,Electrical Engineering,B.Tech.,57
6,Civil Engineering,B.Tech.,56
7,Electrical Engineering,Dual Degree (B.Tech. + M.Tech.),48
8,Industrial Design Centre,M.Des.,48
9,Metallurgical Engineering and Materials Science,B.Tech.,47
10,Civil Engineering,M.Tech.,36
11,Mechanical Engineering,M.Tech.,36
12,Aerospace Engineering,B.Tech.,28
13,Metallurgical Engineering and Materials Science,M.Tech.,24
14,Mechanical Engineering,Dual Degree (B.Tech. + M.Tech.),23
15,Applied Statistics and Informatics,M.Sc.,23
16,Geoinformatics and Natural Resources Engineering,M.Tech.,23
17,Aerospace Engineering,M.Tech.,20
18,Engineering Physics,B.Tech.,19
19,"Energy Science and Engineering, Energy Science...",Dual Degree (B.Tech. + M.Tech.),16
20,Chemical Engineering,M.Tech.,15
21,Industrial Engineering & Operations Research,M.Tech.,15
22,Metallurgical Engineering and Materials Science,Dual Degree (B.Tech. + M.Tech.),14
23,Energy Science and Engineering,M.Tech.,14
24,Industrial Design Centre,B.Des.,12
25,Chemistry,B.S.,10
26,Economics,B.S.,10
27,"Industrial Design Centre, Industrial Design Ce...",Dual Degree (B.Des. + M. Des.),9
28,Technology and Development,M.Tech.,8
29,"Aerospace Engineering, Aerospace Engineering",Dual Degree (B.Tech. + M.Tech.),6
30,"Mechanical Engineering, Mechanical Engineering",Dual Degree (B.Tech. + M.Tech.),6
31,Environmental Science & Engineering,M.Tech.,6
32,Civil Engineering,Dual Degree (B.Tech. + M.Tech.),5
33,"Electrical Engineering, Electrical Engineering",Dual Degree (B.Tech. + M.Tech.),5
34,Engineering Physics,Dual Degree (B.Tech. + M.Tech.),5
35,Industrial Engineering & Operations Research,M.Sc.,5
36,Earth Sciences,M.Tech.,5
37,Systems & Control Engineering,M.Tech.,5
38,Electrical Engineering,Ph.D.,5
39,"Electrical Engineering, Electrical Engineering",Dual Degree (M.Tech. + Ph.D.),3
40,Earth Sciences,M.Sc.,3
41,Applied Geophysics,M.Sc.,2
42,Mathematics,M.Sc.,2
43,Biosciences and Bioengineering,M.Tech.,2
44,"Computer Science & Engineering, Computer Scien...",Dual Degree (B.Tech. + M.Tech.),1
45,"Electrical Engineering, Engineering Physics",Dual Degree (B.Tech. + M.Tech.),1
46,"Engineering Physics, Industrial Engineering & ...",Dual Degree (B.Tech. + M.Tech.),1
47,Metallurgical Engineering and Materials Scienc...,Dual Degree (B.Tech. + M.Tech.),1
48,Technology and Development,Dual Degree (M.Tech. + Ph.D.),1
49,Centre for Policy Studies,M.P.P,1
50,Humanities & Social Sciences,M.Phil.,1
51,Computer Science & Engineering,M.S. by research (Exit Degree),1
52,Biosciences and Bioengineering,M.Sc.,1
53,Physics,M.Sc.,1
54,Biosciences and Bioengineering,Ph.D.,1
55,Chemical Engineering,Ph.D.,1
56,Geoinformatics and Natural Resources Engineering,Ph.D.,1
57,Mechanical Engineering,Ph.D.,1
58,Metallurgical Engineering and Materials Science,Ph.D.,1

In [24]:
Program_Stats = df.groupby("Program",as_index = 0)["Roll"].count()
Program_Stats

                            Program  Roll
0                            B.Des.    12
1                              B.S.    20
2                           B.Tech.   466
3    Dual Degree (B.Des. + M. Des.)     9
4   Dual Degree (B.Tech. + M.Tech.)   132
5     Dual Degree (M.Tech. + Ph.D.)     4
6                            M.Des.    48
7                             M.P.P     1
8                           M.Phil.     1
9    M.S. by research (Exit Degree)     1
10                            M.Sc.    37
11                          M.Tech.   398
12                            Ph.D.    10

In [26]:
Program_Stats_Percentage = pd.DataFrame(round(df.value_counts("Program", normalize = True)*100,2))

In [27]:
Program_Stats_Percentage.reset_index(inplace = True)
Program_Stats_Percentage

                            Program      0
0                           B.Tech.  40.91
1                           M.Tech.  34.94
2   Dual Degree (B.Tech. + M.Tech.)  11.59
3                            M.Des.   4.21
4                             M.Sc.   3.25
5                              B.S.   1.76
6                            B.Des.   1.05
7                             Ph.D.   0.88
8    Dual Degree (B.Des. + M. Des.)   0.79
9     Dual Degree (M.Tech. + Ph.D.)   0.35
10                            M.P.P   0.09
11                          M.Phil.   0.09
12   M.S. by research (Exit Degree)   0.09

In [47]:
company_stats = df.groupby(["Company","Day"],as_index=False)["Roll"].count().sort_values(["Roll","Company"], ascending = [0,1])
company_stats.reset_index(drop = True)

                                         Company  Day  Roll
0                               Placement Office   16   147
1                                         Oracle    2    23
2                                  TATA Projects    3    16
3                              Texas Instruments    1    15
4                                      Axis Bank    3    13
..                                           ...  ...   ...
278  WorldQuant Research (India) Private Limited    1     1
279                    Yashraj Biotechnology Ltd   14     1
280                         ZunRoof Tech Pvt Ltd    4     1
281                                       kubric    4     1
282                      www.globalfoundries.com   10     1

[283 rows x 3 columns]

In [48]:
company_stats[company_stats["Company"].str.contains("Hp",flags=re.I, regex=True)]

Empty DataFrame
Columns: [Company, Day, Roll]
Index: []

In [49]:
company_stats.head(20)

                                       Company  Day  Roll
197                           Placement Office   16   147
190                                     Oracle    2    23
242                              TATA Projects    3    16
253                          Texas Instruments    1    15
32                                   Axis Bank    3    13
92                      Google India Pvt. Ltd.    1    13
110                     ICICI Lombard GIC Ltd.    5    12
166    Micron Technologies Operation India LLP    3    12
48               Bridgei2i Analytics Solutions   16    11
109                                 ICICI Bank    3    11
167                  Microsoft India Pvt. Ltd.    1    11
250                  Tata Consultancy Services  300    11
9                                    Accenture   16    10
77       ExxonMobil Lubricants Private Limited    2    10
119  Impact Guru Technology Ventures Pvt. Ltd.   10    10
129                                      Intel    2    10
207                                   Qualcomm    1    10
214                         Rakuten Mobile Inc    3    10
249                  Tata Consultancy Services   16    10
5                                     ANZ Bank    3     9